* Q1
a) SELECT on MovieStar, SELECT on MovieExec
b) SELECT on MovieExec, SELECT on Movies, SELECT on StarsIn
c) SELECT, INSERT on Studio, SELECT on Movies
d) DELETE on StarsIn
e) UPDATE on MovieExec, SELECT on MovieExec.cert, SELECT on Studio 
f) none?
g) SELECT on RichPress, SELECT on Studio, SELECT on MovieExec 

* Q2
See next page
* Q3
#+BEGIN_SRC sql :cmdline -h studentdb.csc.uvic.ca -U alrm imdb 
CREATE OR REPLACE FUNCTION alrm_sfunc(char(400)) RETURNS table(id varchar(400), year integer, rank double precision, votes integer) as $$
with things as 
  (SELECT * FROM productions NATURAL JOIN directors WHERE attr is NULL and pid=$1)
SELECT things.id, year, rank, votes FROM things LEFT JOIN ratings ON things.id = ratings.id;
$$ LANGUAGE SQL;
#+END_SRC

#+RESULTS:
| CREATE FUNCTION |
|-----------------|

#+BEGIN_SRC sql :cmdline -h studentdb.csc.uvic.ca -U alrm imdb 
SELECT * FROM alrm_sfunc('Nolan, Christopher (I)');
#+END_SRC

#+RESULTS:
| id                            | year | rank |   votes |
|-------------------------------+------+------+---------|
| Quay (2015)                   | 2015 |    8 |     357 |
| The Dark Knight (2008)        | 2008 |    9 | 1685825 |
| The Dark Knight Rises (2012)  | 2012 |  8.5 | 1151061 |
| The Exec (2006) {{SUSPENDED}} | 2006 |      |         |
| The Prestige (2006)           | 2006 |  8.5 |  849119 |
| Batman Begins (2005)          | 2005 |  8.3 |  986936 |
| Dunkirk (2017)                | 2017 |      |         |
| Insomnia (2002)               | 2002 |  7.2 |  219782 |
| Interstellar (2014)           | 2014 |  8.6 |  937348 |
| Doodlebug (1997)              | 1997 |  7.1 |   11415 |
| Following (1998)              | 1998 |  7.6 |   66121 |
| Inception (2010)              | 2010 |  8.8 | 1476746 |
| Memento (2000)                | 2000 |  8.5 |  849849 |

#+RESUTLS:

#+schema:
| List of relations |              |       |          |
|-------------------+--------------+-------+----------|
| Schema            | Name         | Type  | Owner    |
| public            | aka          | table | dmg      |
| public            | as5          | table | dmg      |
| public            | color        | table | dmg      |
| public            | countries    | table | dmg      |
| public            | directors    | table | dmg      |
| public            | episodes     | table | dmg      |
| public            | genres       | table | dmg      |
| public            | languages    | table | dmg      |
| public            | links        | table | dmg      |
| public            | locations    | table | dmg      |
| public            | mid1         | table | dmg      |
| public            | parts        | table | angushay |
| public            | partshistory | table | angushay |
| public            | persons      | table | dmg      |
| public            | productions  | table | dmg      |
| public            | ratings      | table | dmg      |
| public            | roles        | table | dmg      |
| public            | thematrix    | table | hhart4   |
| public            | var          | table | rafatm   |

